app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 5 LIMIT 1
---
  def show
    @question = Question.find(params[:id])

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 8 LIMIT 1
---
  def edit
    @question = Question.find(params[:id])