app/controllers/surveys_controller.rb

SELECT `surveys`.* FROM `surveys`
---
  def index
    @surveys = Survey.all

SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
---
  def show
    @survey = Survey.find(params[:id])

SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 1 LIMIT 1
---
  def edit
    @survey = Survey.find(params[:id])

INSERT INTO `surveys` (`course_id`, `created_at`, `instructor_id`, `question_1`, `response`, `section`, `survey_id`, `updated_at`) VALUES ('', '2013-04-16 20:49:12', '', '', '', '', '', '2013-04-16 20:49:12')
---
  def create
    @survey = Survey.new(params[:id])

    respond_to do |format|
      if @survey.save

SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 2 LIMIT 1
---
  def update
    @survey = Survey.find(params[:id])